import './Projects.css';
import React from 'react';
import Helmet from 'react-helmet';

const completedProjects = [
  {
    pHeaderTitle: `احداث مخزن ٣١٠٠٠مترمکعبی دو منظوره آب شیرین و آتش نشانی در پالایش نفت بندرعباس (PC)`,
    ptext: `احداث مخزن ٣١٠٠٠متر مکعبی آب شامل تسطیح زمین، احداث فونداسیون، ساخت مخزن سقف ثابت، لوله کشی های ارتباطی، سیستمهای برق، کنترل ابزار دقیق و حفاظت کاتدیک مورد نیاز`,
    pImg: "./projects_photos/1.png"
  },
  {
    pHeaderTitle: `احداث مخازن سقف شناور ١٠ هزار تنی بنزن و ٥ هزار متر مکعبی گسولین در پتروشیمی پارس (PCC)`,
    ptext: `حداث مخزن ١٠٠٠٠ تنی گسولین و ٥٠٠٠ مترکعبی بنزن شامل تسطیح زمین، احداث فونداسیون، ساخت مخزن سقف ثابت، لوله کشی های ارتباطی، سیستمهای برق، کنترل ابزار دقیق و حفاظت کاتدیک مورد نیاز`,
    pImg: "./projects_photos/2.png"
  },
  {
    pHeaderTitle: `احداث پکیچ Gas Blanketing واحد مخازن به روش PSA جهت تولید نیتروژن با خلوص ٩٩/٩٩٩% در پالایش نفت تهران (EPC)`,
    ptext: `حداث دو عدد کمپرسور سانتریفیوژ ، مبدل پوسته / لوله ، پمپ های سیستم خنک کاری کمپرسور ، مخازن تحت فشار ، درایر هوا ، درایر گاز نیتروژن ، مولدهای تولید گاز نیتروژن (Carbon Molecular Sieves)، لوله کشی های کربن استیل ارتباطی و تجهیزات برق و ابزار دقیق مربوطه به صورت EPC `,
    pImg: "./projects_photos/3.png"
  },
  {
    pHeaderTitle: `تکمیل سیستم واحد SOUR WATER TREATMENT در پالایش نفت تهران(EPC)`,
    ptext: `برداشتن تجهیزات و تخریب فونداسیون های موجود، طراحی، تامین تجهیزات و احداث فونداسیون تجهیزات جدید، ساخت تجهیزات ثابت و دوار شامل کولرهوایی، مبدلها، مخازن تحت فشار، پمپها، لوله کشی های ارتباطی و کلیه کارهای برق و ابزار دقیق جهت تکمیل واحد آب ترش قدیم پالایشگاه تهران`,
    pImg: "./projects_photos/4.png"
  },
  {
    pHeaderTitle: `احداث پنج دستگاه مخزن سقف شناور ذخیره فرآورده های نفتی به ظرفیت ٤٤٣٦٠ متر مکعب در انبارنفت شهرهای قم ، سمنان ، بجنورد و ماکو (EPC)`,
    ptext: `احداث یکدستگاه مخزن سقف ثابت در انبار نفت سمنان به ظرفیت ٨٦٣٠ مترمکعب بصورت EPC شامل احداث فونداسیون ها، باندوال مخازن،ساخت مخزن، لوله کشی ارتباطی، سیستم آب آتش نشانی و فوم، سیستمهای برق، کنترل ، ابزار دقیق و حفاظت کاتدیک مورد نیاز`,
    pImg: "./projects_photos/5.png"
  },
  {
    pHeaderTitle: `احداث مخزن سقف شناور cold slops در پالایش نفت تهران`,
    ptext: `خدمات طراحی، تامین تجهیزات،ساخت،نصب و راه اندازی مخازن شامل احداث فونداسیون، لحاف بتنی، دیوار آتش، ساخت مخزن سقف شناور،لوله کشیهای ارتباطی،عایق کاری، تجهیزات اعلام و اطفا حریق و تجهیزات برق و ابزار دقیق مربوطه`,
    pImg: "./projects_photos/6.png"
  },
  {
    pHeaderTitle: `احداث واحد تولید آب دمین بصورت MED در پتروشیمی مبین (PC)`,
    ptext: `کلیه عملیات مربوط به احداث ساختمان،ساخت سوله ،کالورت، تامین، ساخت ونصب مخازن تحت فشار شامل سختی گیر ها، برج ها، مخازن میکسبد، پمپ ها، لوله کشی استنلس استیل، کربن استیل، فایبر گلاس و تجهیزات برق و ابزار دقیق مربوطه شامل کابل های برق و ابزار دقیق، سینی کاری و کاندوییت، گلند کاری مربوطه ،تابلو برق ، سیستم روشنایی و سیستم کنترل مربوطه`,
    pImg: "./projects_photos/7.png"
  },
  {
    pHeaderTitle: `احداث مخزن ١٥٠٠٠ متر مکعبی ذخیره در پتروشیمی مبین (PC)`,
    ptext: `احداث مخزن ١٥٠٠٠ متر مکعبی آب شامل تسطیح زمین، احداث فونداسیون، ساخت مخزن سقف ثابت، لوله کشی های ارتباطی، سیستمهای برق، کنترل ابزار دقیق و حفاظت کاتدیک مورد نیاز`,
    pImg: "./projects_photos/8.png"
  },
  {
    pHeaderTitle: `عملیات تکمیل آبرسانی به آزادشهر از محور رامیان و احداث مخزن ٢٠٠٠ مترمکعبی رامیان، خط لوله GRP به طول ٩ کیلومتر به همراه لوله کشی های ارتباطی و سیستم برق و ابزاردقیق به روش PC`,
    ptext: `احداث مخزن ٢٠٠٠ متر مکعبی بتنی شامل تسطیح زمین، احداث فونداسیون، ساخت مخزن، لوله کشی های ارتباطی، ساختمان های سر چاه، سیستمهای برق، کنترل ابزار دقیق و حفاظت کاتدیک مورد نیاز `,
    pImg: "./projects_photos/9.png"
  },
  {
    pHeaderTitle: `احداث مخزن ١٠٠٠٠متر مکعبی فلزی آب شیرین وآتش نشانی در پالایش گاز بید بلند (PC)`,
    ptext: `احداث مخزن ١٠٠٠٠متر مکعبی آب شامل تسطیح زمین، احداث فونداسیون، ساخت مخزن سقف ثابت، لوله کشی های ارتباطی، سیستمهای برق، کنترل ابزار دقیق و حفاظت کاتدیک مورد نیاز`,
    pImg: "./projects_photos/10.png"
  }
]

const doingProjects = [
  {
    pHeaderTitle: `مهندسی، تامین کالا و تجهیزات، ساخت و نصب دو دستگاه آب شیرین کن و کارهای متفرقه در منطقه ویژه اقتصادی لامرد`
    , ptext: `آب شیرین کن با ورودی آب شهری و آب چاه همراه با سیستم تصفیه مناسب بصورت کامل، طراحی، ساخت، حمل و نصب سوله و منبع، خط انتقال آب شور از چاه تا منبع، امحاء پس ماند دستگاه های آب شیرین کن`
    , pImg: "./projects_photos/inc1.png"
  }
  , {
    pHeaderTitle: `تکمیل عملیات ساختمانی (سیویل)، تهیه ، ساخت و نصب تجهیزات الکترومکانیکال سیستم کنترل و ابزار دقیق نیم مدول دوم تصفیه خانه شهر جدید هشتگرد به روش PC`
    , ptext: `پروژه:بهره برداری از کل تاسیسات و تجهیزات نیم مدول اول و دوم تصفیه خانه به مدت ١٢ ماه شمسی`
    , pImg: "./projects_photos/inc2.png"
  }
  , {
    pHeaderTitle: `عملیات ساختمانی،تامین تجهیزات الکترومکانیکال، برقی ، مکانیکی و سیستم کنترل ،نصب و راه اندازی و بهره برداری ١٢ ماهه مدول دوم تصفیه خانه فاضلاب شهرک صنعتی لیا`
    , ptext: `اجرای کامل عملیات ساختمانی تهیه، ساخت، آزمایش در کارخانه سازنده، حمل تجهیزات، نصب، آزمایش، راه اندازی، تهیه دستورالعملهای بهره برداری و راهبری، آموزش کادر منتخب کارفرما، بهره برداری از تصفیه خانه به مدت ١٢ ماه`
    , pImg: "./projects_photos/inc3.png"
  }
  , {
    pHeaderTitle: `انجام فعالیت های باقیمانده کارهای عمومی سیویل، مکانیک و لوله کشی، برق و ابزار دقیق فاز زود هنگام پروژه پتروشیمی مخازن سبز عسلویه`
    , ptext: `اجرای فعالیت های بخش سیویل ، ایمنی ،برق ، ابزلر دقیق و سیستم کنترل و همکاری در پیش راه اندازی پتروشیمی مخازن سبز عسلویه `
    , pImg: "./projects_photos/inc4.png"
  }
]

function Projects() {
  return (
    <div className='projects-container'>
        <Helmet>
        <title>اهرم انرژی | پروژه‌ها</title>
      </Helmet>
      <div className='done-container'>
        <div className='containers-header'>
          <h2>پروژه‌های انجام شده</h2>
        </div>
        {completedProjects.map((project, index) => (
          <div key={index} className='inner-container'>
            <div className='inner-container-header'>
              <h3 style={{ paddingRight: '20px' }}>{project.pHeaderTitle}</h3>
            </div>
            <div className='inner-container-body'>
              <img key={index} src={require(`${project.pImg}`)} alt={`cmpImage ${index + 1}`} />
              <p>{project.ptext}</p>
            </div>
          </div>
        ))}
      </div>

      <div className='doing-container'>
        <div className='containers-header'>
          <h2>پروژه‌های در حال انجام</h2>
        </div>
        {doingProjects.map((project, index) => (
          <div key={index} className='inner-container'>
            <div className='inner-container-header'>
              <h3 style={{ paddingRight: '20px' }}>{project.pHeaderTitle}</h3>
            </div>
            <div className='inner-container-body'>
              <img key={index} src={require(`${project.pImg}`)} alt={`incmpImage ${index + 1}`} />
              <p>{project.ptext}</p>
            </div>
          </div>
        ))}
      </div>
    </div>
  );
}

export default Projects;